'''
练习1：
有一个列表，其中包括10个元素，例如这个列表是[1,	2,	3,	4,	5,	6,	7,	8,	9,	0	]	，	要求将列表
中的每个元素一次向前移动一个位置，第一个元素到列表的最后，然后输出这个列表。最终
样式是[2,3,4,5,6,7,8,9,0,1]
'''
# 方法1
# tmp_lst = [1,2,3,4,5,6,7,8,9,0]
# tmp = []
# for i in range(1,len(tmp_lst)):
#     tmp.append(tmp_lst[i])
# tmp.append(tmp_lst[0])
# print(tmp)
#方法二
tmp_lst = [1,2,3,4,5,6,7,8,9,0]
tmp = tmp_lst.pop(0)
tmp_lst.append(tmp)
print(tmp_lst)

'''
练习二
1.	   产生一个列表，其中有40个元素，每个元素是0到100的一个随机整数
2.	   如果这个列表中的数据代表着某个班级40人的分数，请计算成绩低于平均分的学生人数，并输出
3.	   对上面的列表元素从大到小排序
'''
